In [2]:
import pandas as pd
import numpy as np
import re

# create DataFrame

In [2]:
data = {
    'string': ['a', 'b', 'c', 'd', 'e', 'f'],
    'int': [0, 1, 2, 1, 2, 3],
    'float': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}

In [3]:
df = pd.DataFrame(data)
df

   float  int string
0    1.5    0      a
1    1.7    1      b
2    3.6    2      c
3    2.4    1      d
4    2.9    2      e
5    3.2    3      f

In [4]:
dfWithIndex = pd.DataFrame(data, index=["one", "two", "three", "four", "five", "six"])
dfWithIndex

       float  int string
one      1.5    0      a
two      1.7    1      b
three    3.6    2      c
four     2.4    1      d
five     2.9    2      e
six      3.2    3      f

In [5]:
dfWithDict = pd.DataFrame({"float":{"one":1.1, "two":2.2, "three":3.3}, "int":{"two":2, "three":3, "four":4}, "string":{"three":"aaa", "four":"bbb", "five":"ccc"}})
dfWithDict

       float  int string
five     NaN  NaN    ccc
four     NaN  4.0    bbb
one      1.1  NaN    NaN
three    3.3  3.0    aaa
two      2.2  2.0    NaN

# check index is unique

In [6]:
dfWithIndex.index.is_unique

True

# sort by index

In [7]:
dfWithIndex.sort_index()

       float  int string
five     2.9    2      e
four     2.4    1      d
one      1.5    0      a
six      3.2    3      f
three    3.6    2      c
two      1.7    1      b

In [8]:
dfWithIndex.sort_index(axis=1, ascending=False)

      string  int  float
one        a    0    1.5
two        b    1    1.7
three      c    2    3.6
four       d    1    2.4
five       e    2    2.9
six        f    3    3.2

# sort by value

In [9]:
dfWithIndex.sort_values(by=["int", "string"])

       float  int string
one      1.5    0      a
two      1.7    1      b
four     2.4    1      d
three    3.6    2      c
five     2.9    2      e
six      3.2    3      f

# head

In [10]:
df.head()

   float  int string
0    1.5    0      a
1    1.7    1      b
2    3.6    2      c
3    2.4    1      d
4    2.9    2      e

# set columns order

In [11]:
columnsOrderDf = pd.DataFrame(data, columns=['string', 'int', 'float'])
columnsOrderDf

  string  int  float
0      a    0    1.5
1      b    1    1.7
2      c    2    3.6
3      d    1    2.4
4      e    2    2.9
5      f    3    3.2

# get specific column

In [12]:
df["string"]

0    a
1    b
2    c
3    d
4    e
5    f
Name: string, dtype: object

In [13]:
df.string

0    a
1    b
2    c
3    d
4    e
5    f
Name: string, dtype: object

# get specific row

In [14]:
dfWithIndex.loc["three", ["int", "string"]]

int       2
string    c
Name: three, dtype: object

In [15]:
dfWithIndex.iloc[2, [1, 2]]

int       2
string    c
Name: three, dtype: object

# update value

In [16]:
updateValueDf = pd.DataFrame(data)

In [17]:
updateValueDf["string"] = "x"
updateValueDf

   float  int string
0    1.5    0      x
1    1.7    1      x
2    3.6    2      x
3    2.4    1      x
4    2.9    2      x
5    3.2    3      x

In [18]:
updateValueDf["float"] = np.arange(6.)
updateValueDf

   float  int string
0    0.0    0      x
1    1.0    1      x
2    2.0    2      x
3    3.0    1      x
4    4.0    2      x
5    5.0    3      x

In [19]:
series = pd.Series([100, 300, 500], index=[1, 3, 5])
updateValueDf["float"] = series
updateValueDf

   float  int string
0    NaN    0      x
1  100.0    1      x
2    NaN    2      x
3  300.0    1      x
4    NaN    2      x
5  500.0    3      x

# add new column

In [20]:
addNewColumnDf = pd.DataFrame(data)
addNewColumnDf['new_column'] = addNewColumnDf.int > 1
addNewColumnDf

   float  int string  new_column
0    1.5    0      a       False
1    1.7    1      b       False
2    3.6    2      c        True
3    2.4    1      d       False
4    2.9    2      e        True
5    3.2    3      f        True

# delete column

In [21]:
deleteColumnDf_0 = pd.DataFrame(data)
del deleteColumnDf_0["int"]
deleteColumnDf_0

   float string
0    1.5      a
1    1.7      b
2    3.6      c
3    2.4      d
4    2.9      e
5    3.2      f

In [22]:
deleteColumnDf_1 = pd.DataFrame(data)
deleteColumnDf_1.drop(["string"], axis='columns')

   float  int
0    1.5    0
1    1.7    1
2    3.6    2
3    2.4    1
4    2.9    2
5    3.2    3

In [23]:
deleteColumnDf_inplace = pd.DataFrame(data)
deleteColumnDf_inplace.drop(["string"], axis='columns', inplace=True)
deleteColumnDf_inplace

   float  int
0    1.5    0
1    1.7    1
2    3.6    2
3    2.4    1
4    2.9    2
5    3.2    3

# delete record

In [24]:
deleteRecordDf = pd.DataFrame(data)
deleteRecordDf.drop([2,4])

   float  int string
0    1.5    0      a
1    1.7    1      b
3    2.4    1      d
5    3.2    3      f

In [25]:
deleteRecordDf_inplace = pd.DataFrame(data)
deleteRecordDf_inplace.drop([2,4], inplace=True)
deleteRecordDf_inplace

   float  int string
0    1.5    0      a
1    1.7    1      b
3    2.4    1      d
5    3.2    3      f

# transpose

In [26]:
transposedDf = pd.DataFrame(data)
transposedDf.T

          0    1    2    3    4    5
float   1.5  1.7  3.6  2.4  2.9  3.2
int       0    1    2    1    2    3
string    a    b    c    d    e    f

# sub dataframe

In [27]:
subDfByDict = {"subInt" : df.int[1:5], "subFloat" : df.float[:-3]}
pd.DataFrame(subDfByDict)

   subFloat  subInt
0       1.5     NaN
1       1.7     1.0
2       3.6     2.0
3       NaN     1.0
4       NaN     2.0

In [28]:
dfWithIndex.loc["two":"five", "float":"string"]

       float  int string
two      1.7    1      b
three    3.6    2      c
four     2.4    1      d
five     2.9    2      e

In [29]:
df.iloc[:, :3][df.index % 2 == 0]

   float  int string
0    1.5    0      a
2    3.6    2      c
4    2.9    2      e

# get value array

In [30]:
df.values

array([[1.5, 0, 'a'],
       [1.7, 1, 'b'],
       [3.6, 2, 'c'],
       [2.4, 1, 'd'],
       [2.9, 2, 'e'],
       [3.2, 3, 'f']], dtype=object)

# get index

In [31]:
dfWithIndex.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

# get max index

In [32]:
maxIndexDf = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])
maxIndexDf.idxmax()

0    2
1    2
2    2
dtype: int64

# reindex

In [33]:
column_reindex = pd.DataFrame(
    np.arange(9).reshape((3, 3)),
    index=['a', 'c', 'd'],
    columns=['Ohio', 'Texas', 'California']
)
print(column_reindex)
print("-------------------")
print(column_reindex.reindex(columns=['Texas', 'Utah', 'California']))

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8
-------------------
   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [34]:
df.reindex(index=[1,3,5], columns=["float", "string", "not_exist"])

   float string  not_exist
1    1.7      b        NaN
3    2.4      d        NaN
5    3.2      f        NaN

# add

In [35]:
addDf_0_0 = pd.DataFrame([1,2,3], index=["a", "b", "c"])
addDf_0_1 = pd.DataFrame([20,30,40], index=["b", "c", "d"])
addDf_0_0 + addDf_0_1

      0
a   NaN
b  22.0
c  33.0
d   NaN

In [36]:
addDf_1_0 = pd.DataFrame([1,2,3], index=["a", "b", "c"])
addDf_1_1 = pd.DataFrame([20,30,40], index=["b", "c", "d"])
addDf_1_0.add(addDf_1_1, fill_value=0)

      0
a   1.0
b  22.0
c  33.0
d  40.0

# sum

In [37]:
sumDf = pd.DataFrame([[1,2,3], [4,None,6], [7,8,9]])
sumDf

   0    1  2
0  1  2.0  3
1  4  NaN  6
2  7  8.0  9

In [38]:
sumDf.sum()

0    12.0
1    10.0
2    18.0
dtype: float64

In [39]:
sumDf.sum(skipna=False)

0    12.0
1     NaN
2    18.0
dtype: float64

# accumulation

In [40]:
accumulationDf = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])
accumulationDf.cumsum()

    0   1   2
0   1   2   3
1   5   7   9
2  12  15  18

# describe

In [41]:
describeDf = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])
describeDf.describe()

         0    1    2
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

# apply function

In [42]:
applyFunctionDf = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])
applyFunctionDf

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [43]:
applyFunctionDf.apply(lambda x : x.max())

0    7
1    8
2    9
dtype: int64

In [44]:
applyFunctionDf.apply(lambda x : x.max(), axis='columns')

0    3
1    6
2    9
dtype: int64

In [45]:
applyFunctionDf.apply(lambda x : pd.Series([x.min(), x.max()], index=['min', 'max']))

     0  1  2
min  1  2  3
max  7  8  9

# apply map

In [46]:
applyMapDf = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])
applyMapDf.applymap(lambda x : x * 10)

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

# rank

In [47]:
rankDf = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])

In [48]:
rankDf.rank()

     0    1    2
0  1.0  1.0  1.0
1  2.0  2.0  2.0
2  3.0  3.0  3.0

In [49]:
rankDf.rank(axis='columns')

     0    1    2
0  1.0  2.0  3.0
1  1.0  2.0  3.0
2  1.0  2.0  3.0

# generate datetime index

In [50]:
dates = pd.date_range('1/1/2000', periods=7)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

# drop NaN

In [51]:
dropNanDf = pd.DataFrame([
    [1.1, 2.2, 3.3], 
    [4.4, np.NaN, np.NaN],
    [np.NaN, np.NaN, np.NaN], 
    [np.NaN, 11.11, 12.12]
])
dropNanDf

     0      1      2
0  1.1   2.20   3.30
1  4.4    NaN    NaN
2  NaN    NaN    NaN
3  NaN  11.11  12.12

In [52]:
dropNanDf.dropna()

     0    1    2
0  1.1  2.2  3.3

In [53]:
dropNanDf.dropna(how='all')

     0      1      2
0  1.1   2.20   3.30
1  4.4    NaN    NaN
3  NaN  11.11  12.12

In [54]:
dropNanDf.dropna(thresh=2)

     0      1      2
0  1.1   2.20   3.30
3  NaN  11.11  12.12

# fill NaN

In [55]:
fillNanDf = pd.DataFrame([
    [1.1, 2.2, 3.3], 
    [4.4, np.NaN, np.NaN],
    [np.NaN, np.NaN, np.NaN], 
    [np.NaN, 11.11, 12.12]
])
fillNanDf

     0      1      2
0  1.1   2.20   3.30
1  4.4    NaN    NaN
2  NaN    NaN    NaN
3  NaN  11.11  12.12

In [56]:
fillNanDf.fillna(-1)

     0      1      2
0  1.1   2.20   3.30
1  4.4  -1.00  -1.00
2 -1.0  -1.00  -1.00
3 -1.0  11.11  12.12

In [57]:
fillNanDf.fillna({0: - 100, 1: -200, 2: -300})

       0       1       2
0    1.1    2.20    3.30
1    4.4 -200.00 -300.00
2 -100.0 -200.00 -300.00
3 -100.0   11.11   12.12

In [58]:
fillNanDf.fillna(method='ffill')

     0      1      2
0  1.1   2.20   3.30
1  4.4   2.20   3.30
2  4.4   2.20   3.30
3  4.4  11.11  12.12

In [59]:
fillNanDf.fillna(method='ffill', limit=1)

     0      1      2
0  1.1   2.20   3.30
1  4.4   2.20   3.30
2  4.4    NaN    NaN
3  NaN  11.11  12.12

In [60]:
removeDuplicateDf = pd.DataFrame({
    'col_0': ['one', 'two'] * 3 + ['two'],
    'col_1': [1, 1, 2, 3, 3, 4, 4]
})
removeDuplicateDf

  col_0  col_1
0   one      1
1   two      1
2   one      2
3   two      3
4   one      3
5   two      4
6   two      4

In [61]:
removeDuplicateDf.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [62]:
removeDuplicateDf.drop_duplicates()

  col_0  col_1
0   one      1
1   two      1
2   one      2
3   two      3
4   one      3
5   two      4

In [63]:
removeDuplicateDf.drop_duplicates(['col_0'])

  col_0  col_1
0   one      1
1   two      1

In [64]:
removeDuplicateDf.drop_duplicates(['col_0'], keep='last')

  col_0  col_1
4   one      3
6   two      4

# mapping data

In [65]:
mappingDataDf = pd.DataFrame({
    'col_0': ['one', 'two'] * 3 + ['two'],
    'col_1': [1, 1, 2, 3, 3, 4, 4]
})
mappingDataDf

  col_0  col_1
0   one      1
1   two      1
2   one      2
3   two      3
4   one      3
5   two      4
6   two      4

In [66]:
mappingData = {
    'one': '111',
    'two': '222'
}
mappingData

{'one': '111', 'two': '222'}

In [67]:
mappingDataDf['col_2'] = mappingDataDf['col_0'].map(mappingData)
mappingDataDf

  col_0  col_1 col_2
0   one      1   111
1   two      1   222
2   one      2   111
3   two      3   222
4   one      3   111
5   two      4   222
6   two      4   222

In [68]:
mappingDataDf['col_3'] = mappingDataDf['col_1'].map(lambda x : x * 10)
mappingDataDf

  col_0  col_1 col_2  col_3
0   one      1   111     10
1   two      1   222     10
2   one      2   111     20
3   two      3   222     30
4   one      3   111     30
5   two      4   222     40
6   two      4   222     40

# replace data

In [69]:
replaceDataDf = pd.DataFrame({
    'col_0': [0, 1, 2],
    'col_1': [1, 2, 3],
    'col_2': [2, 3, 4]
})
replaceDataDf

   col_0  col_1  col_2
0      0      1      2
1      1      2      3
2      2      3      4

In [70]:
replaceDataDf.replace({1: np.nan, 2: 999})

   col_0  col_1  col_2
0    0.0    NaN  999.0
1    NaN  999.0    3.0
2  999.0    3.0    4.0

# processing outliers

In [71]:
processingOutliersDf = pd.DataFrame(np.random.randn(1000, 4))
processingOutliersDf.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.014918    -0.042432    -0.014850     0.025893
std       0.987974     1.029280     0.988508     0.959765
min      -2.912410    -3.256768    -2.831266    -3.078002
25%      -0.676163    -0.789634    -0.690671    -0.641370
50%       0.017279    -0.051275    -0.032365    -0.005065
75%       0.606255     0.686689     0.635105     0.696115
max       3.183789     3.506275     2.772787     2.888817

In [72]:
processingOutlierColDf = processingOutliersDf[0]
processingOutlierColDf[np.abs(processingOutlierColDf) > 3]

150    3.183789
688    3.013160
Name: 0, dtype: float64

In [73]:
processingOutliersDf[(np.abs(processingOutliersDf) > 3).any(1)]

            0         1         2         3
150  3.183789  1.032858 -2.359148 -0.111614
223  1.591416 -3.256768  0.480198  0.489611
498  1.546479 -0.249514 -1.184657 -3.078002
688  3.013160  0.588442  0.909859  1.861724
921  0.320728  3.506275  0.138349  1.000828

In [74]:
processingOutliersDf[np.abs(processingOutliersDf) > 3]

      0   1   2   3
0   NaN NaN NaN NaN
1   NaN NaN NaN NaN
2   NaN NaN NaN NaN
3   NaN NaN NaN NaN
4   NaN NaN NaN NaN
5   NaN NaN NaN NaN
6   NaN NaN NaN NaN
7   NaN NaN NaN NaN
8   NaN NaN NaN NaN
9   NaN NaN NaN NaN
10  NaN NaN NaN NaN
11  NaN NaN NaN NaN
12  NaN NaN NaN NaN
13  NaN NaN NaN NaN
14  NaN NaN NaN NaN
15  NaN NaN NaN NaN
16  NaN NaN NaN NaN
17  NaN NaN NaN NaN
18  NaN NaN NaN NaN
19  NaN NaN NaN NaN
20  NaN NaN NaN NaN
21  NaN NaN NaN NaN
22  NaN NaN NaN NaN
23  NaN NaN NaN NaN
24  NaN NaN NaN NaN
25  NaN NaN NaN NaN
26  NaN NaN NaN NaN
27  NaN NaN NaN NaN
28  NaN NaN NaN NaN
29  NaN NaN NaN NaN
..   ..  ..  ..  ..
970 NaN NaN NaN NaN
971 NaN NaN NaN NaN
972 NaN NaN NaN NaN
973 NaN NaN NaN NaN
974 NaN NaN NaN NaN
975 NaN NaN NaN NaN
976 NaN NaN NaN NaN
977 NaN NaN NaN NaN
978 NaN NaN NaN NaN
979 NaN NaN NaN NaN
980 NaN NaN NaN NaN
981 NaN NaN NaN NaN
982 NaN NaN NaN NaN
983 NaN NaN NaN NaN
984 NaN NaN NaN NaN
985 NaN NaN NaN NaN
986 NaN NaN NaN NaN
987 NaN NaN NaN NaN
988 NaN NaN NaN NaN
989 NaN NaN NaN NaN
990 NaN NaN NaN NaN
991 NaN NaN NaN NaN
992 NaN NaN NaN NaN
993 NaN NaN NaN NaN
994 NaN NaN NaN NaN
995 NaN NaN NaN NaN
996 NaN NaN NaN NaN
997 NaN NaN NaN NaN
998 NaN NaN NaN NaN
999 NaN NaN NaN NaN

[1000 rows x 4 columns]

In [75]:
processingOutliersDf[np.abs(processingOutliersDf) > 3] = np.sign(processingOutliersDf) * 3
processingOutliersDf

            0         1         2         3
0    0.016096  1.627980  0.419712 -0.063245
1   -1.336419 -0.593053 -0.799581  1.010326
2   -0.742879  0.674512  0.824408 -0.212719
3   -0.401126  0.611138 -1.241040 -1.161842
4   -0.041689  0.074125 -0.684891 -0.330357
5   -0.768610  0.105488  1.070091 -0.154358
6    0.478471  2.002609  2.311387  2.011765
7    0.037242  0.028668 -0.064321  0.548494
8   -0.129152 -0.858344 -0.105206  0.165261
9    0.058789 -0.306752  0.446562 -0.827330
10  -1.273592 -0.847737 -0.464638 -0.176367
11   0.041351 -1.655318 -1.412096  0.193283
12  -0.127680 -1.213961 -1.632500  1.348461
13   0.975865 -2.116785 -0.063259  0.742699
14  -0.137196 -1.068509 -1.876105 -0.414456
15  -0.486186  0.744574 -0.926952  1.227677
16  -2.313748  0.678995  0.861450 -0.145293
17  -0.826520  1.923541 -0.437132  0.400467
18   0.658925 -2.581715 -0.720708  0.999631
19   1.449421  0.354856  0.237051  0.831873
20   1.893019 -0.382280  0.285994  0.478024
21  -0.555113 -1.210802 -0.666703  0.060672
22  -0.786291  0.088244 -0.294416  0.047031
23  -0.649159  0.502978  0.698527  0.132324
24   2.032199  1.640483 -0.987157 -2.242094
25   0.314096  0.118233  1.031071 -0.033736
26  -0.700517  2.265843  1.293113 -0.536970
27  -1.515550  1.883821 -0.916839  0.496433
28  -0.696493  0.332024  0.218405  0.961333
29   1.254525  0.247589 -0.085461  0.934401
..        ...       ...       ...       ...
970 -1.835455 -1.771636  0.842848  1.989553
971  0.336145  0.658495 -0.064860 -0.445722
972 -0.130433  1.756064 -0.564799  0.056681
973 -0.056441  0.736160  0.172395  0.415012
974  1.165498  0.190139 -1.050600 -0.393964
975 -1.816457  0.744113 -1.297642  0.227034
976 -1.672006  0.640301 -0.593910 -0.991151
977  0.196487  0.841845  0.786131  0.337889
978  0.350751  0.456970 -0.469556  0.847448
979  0.168160  1.047263 -0.268859  0.377892
980  0.392219  0.662236 -0.241194  0.133315
981 -0.607912  0.070500 -0.019833  0.234428
982  0.360096 -0.444006  0.640259  0.592532
983  2.127799  1.137718  1.243444 -0.241613
984 -0.390578  2.802273  0.063132 -1.026561
985  0.710946  0.114647 -2.099683 -0.609435
986  0.042081  1.752316 -1.047825 -1.006455
987 -0.051849 -0.484518  0.037728 -0.328808
988  0.431598 -0.423050 -0.728982  0.455711
989  1.269305  0.176245 -0.135042  0.375728
990  0.438902 -1.667243  0.848825 -1.536499
991  0.794242 -1.110667 -0.488531  1.244926
992 -1.349512  1.512365  0.496540 -0.519160
993 -0.454383  1.234258 -0.507374 -2.364660
994 -0.442471  0.943737 -0.684194 -0.482845
995 -0.654704  0.242727  1.174493 -0.618255
996 -1.221141  1.222690 -0.098778  0.214112
997  0.555237 -1.389702  0.816075 -0.292938
998  0.017545 -0.595004 -1.117985  0.234461
999 -0.427447 -2.778866  0.646492 -0.975435

[1000 rows x 4 columns]

# sampling data

In [76]:
samplingDataDf = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
samplingDataDf

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [77]:
samplingDataSampler = np.random.permutation(5)
samplingDataSampler

array([1, 4, 0, 2, 3])

In [78]:
samplingDataDf.take(samplingDataSampler)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15

In [79]:
samplingDataDf.sample(n=3)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3

# dummy variable

In [80]:
dummyVariableDf = pd.DataFrame({'col_0': ['b', 'b', 'a', 'c', 'a', 'b']})
dummyVariableDf

  col_0
0     b
1     b
2     a
3     c
4     a
5     b

In [81]:
pd.get_dummies(dummyVariableDf['col_0'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [82]:
dummyVariable = np.random.rand(10)
dummyVariable

array([0.44944044, 0.86151113, 0.27862162, 0.06169853, 0.47181586,
       0.34929686, 0.83891445, 0.56073951, 0.04943525, 0.77595951])

In [83]:
dummyVariableBins = [0, 0.2, 0.4, 0.6, 0.8, 1]
dummyVariableBins

[0, 0.2, 0.4, 0.6, 0.8, 1]

In [84]:
pd.get_dummies(pd.cut(dummyVariable, dummyVariableBins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           1           0           0
1           0           0           0           0           1
2           0           1           0           0           0
3           1           0           0           0           0
4           0           0           1           0           0
5           0           1           0           0           0
6           0           0           0           0           1
7           0           0           1           0           0
8           1           0           0           0           0
9           0           0           0           1           0

# string function

In [85]:
stringFunctionDf = pd.DataFrame({
    'col_0': ['abc', 'xyz', '123']
})
stringFunctionDf

  col_0
0   abc
1   xyz
2   123

In [86]:
stringFunctionDf['col_0'].str.contains('xy')

0    False
1     True
2    False
Name: col_0, dtype: bool

In [87]:
stringFunctionDf['col_0'].str.findall('[a1]', flags=re.IGNORECASE)

0    [a]
1     []
2    [1]
Name: col_0, dtype: object

In [88]:
stringFunctionDf['col_0'].str.match('[a1]', flags=re.IGNORECASE)

0     True
1    False
2     True
Name: col_0, dtype: bool

# hierarchical indexing

In [89]:
hierarchicalIndexing = pd.DataFrame(
    np.arange(12).reshape((4, 3)),
    index=[
        ['a', 'a', 'b', 'b'], 
        [1, 2, 1, 2]
    ],
    columns=[
        ['col_A', 'col_A', 'col_B'],
        ['col_0', 'col_1', 'col_2']
    ]
)
hierarchicalIndexing

    col_A       col_B
    col_0 col_1 col_2
a 1     0     1     2
  2     3     4     5
b 1     6     7     8
  2     9    10    11

In [90]:
hierarchicalIndexing["col_A"]["col_0"]["a"][2]

3

In [91]:
hierarchicalIndexing.index.names = ['idx_0', 'idx_1']
hierarchicalIndexing.columns.names = ['c_0', 'c_1']
hierarchicalIndexing

c_0         col_A       col_B
c_1         col_0 col_1 col_2
idx_0 idx_1
a     1         0     1     2
      2         3     4     5
b     1         6     7     8
      2         9    10    11

In [92]:
hierarchicalIndexing.swaplevel("idx_0", "idx_1")

c_0         col_A       col_B
c_1         col_0 col_1 col_2
idx_1 idx_0
1     a         0     1     2
2     a         3     4     5
1     b         6     7     8
2     b         9    10    11

In [93]:
hierarchicalIndexing.sort_index(level=1)

c_0         col_A       col_B
c_1         col_0 col_1 col_2
idx_0 idx_1
a     1         0     1     2
b     1         6     7     8
a     2         3     4     5
b     2         9    10    11

In [94]:
hierarchicalIndexing.sum(level="idx_0")

c_0   col_A       col_B
c_1   col_0 col_1 col_2
idx_0
a         3     5     7
b        15    17    19

# indexing with columns

In [95]:
indexingWithColumns = pd.DataFrame({
    'a': range(7), 
    'b': range(7, 0, -1),
    'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
    'd': [0, 1, 2, 0, 1, 2, 3]
})
indexingWithColumns

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [96]:
indexingWithColumns.set_index(['c', 'd'])

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [97]:
indexingWithColumns.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

# reset index

In [98]:
resetIndex = pd.DataFrame(
    np.arange(12).reshape((4, 3)),
    index=[
        ['a', 'a', 'b', 'b'], 
        [1, 2, 1, 2]
    ],
    columns=[
        ['col_A', 'col_A', 'col_B'],
        ['col_0', 'col_1', 'col_2']
    ]
)
resetIndex

    col_A       col_B
    col_0 col_1 col_2
a 1     0     1     2
  2     3     4     5
b 1     6     7     8
  2     9    10    11

In [99]:
resetIndexResult = resetIndex.reset_index()
resetIndexResult

  level_0 level_1 col_A       col_B
                  col_0 col_1 col_2
0       a       1     0     1     2
1       a       2     3     4     5
2       b       1     6     7     8
3       b       2     9    10    11

# join

In [100]:
joinDf_0 = pd.DataFrame({
    'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data': range(7)
})
joinDf_0

   data key
0     0   b
1     1   b
2     2   a
3     3   c
4     4   a
5     5   a
6     6   b

In [101]:
joinDf_1 = pd.DataFrame({
    'key': ['a', 'b', 'd'],
    'data': range(3)
})
joinDf_1

   data key
0     0   a
1     1   b
2     2   d

In [102]:
pd.merge(joinDf_0, joinDf_1, on="key", suffixes=('_left', '_right'), how="outer")

   data_left key  data_right
0        0.0   b         1.0
1        1.0   b         1.0
2        6.0   b         1.0
3        2.0   a         0.0
4        4.0   a         0.0
5        5.0   a         0.0
6        3.0   c         NaN
7        NaN   d         2.0

In [103]:
joinDf_2 = pd.DataFrame({
    'key_2': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data_2': range(7)
})
joinDf_2

   data_2 key_2
0       0     b
1       1     b
2       2     a
3       3     c
4       4     a
5       5     a
6       6     b

In [104]:
joinDf_3 = pd.DataFrame({
    'key_3': ['a', 'b', 'd'],
    'data_3': range(3)
})
joinDf_3

   data_3 key_3
0       0     a
1       1     b
2       2     d

In [105]:
pd.merge(joinDf_2, joinDf_3, left_on='key_2', right_on='key_3', how="outer")

   data_2 key_2  data_3 key_3
0     0.0     b     1.0     b
1     1.0     b     1.0     b
2     6.0     b     1.0     b
3     2.0     a     0.0     a
4     4.0     a     0.0     a
5     5.0     a     0.0     a
6     3.0     c     NaN   NaN
7     NaN   NaN     2.0     d

In [106]:
joinDf_4 = pd.DataFrame({
    'key_4_0': ['a', 'a', 'b'],
    'key_4_1': [1, 2, 1],
    'val_4': ['A', 'B', 'C']
})
joinDf_4

  key_4_0  key_4_1 val_4
0       a        1     A
1       a        2     B
2       b        1     C

In [107]:
joinDf_5 = pd.DataFrame({
    'key_5_0': ['a', 'a', 'b', 'b'],
    'key_5_1': [1, 1, 1, 2],
    'val_5': ['D', 'E', 'F', 'G']
})
joinDf_5

  key_5_0  key_5_1 val_5
0       a        1     D
1       a        1     E
2       b        1     F
3       b        2     G

In [108]:
pd.merge(joinDf_4, joinDf_5, left_on=['key_4_0', 'key_4_1'], right_on=['key_5_0', 'key_5_1'], how='outer')

  key_4_0  key_4_1 val_4 key_5_0  key_5_1 val_5
0       a      1.0     A       a      1.0     D
1       a      1.0     A       a      1.0     E
2       a      2.0     B     NaN      NaN   NaN
3       b      1.0     C       b      1.0     F
4     NaN      NaN   NaN       b      2.0     G

In [109]:
joinDf_6 = pd.DataFrame({
    'key_6': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data_6': range(7)
})
joinDf_6

   data_6 key_6
0       0     b
1       1     b
2       2     a
3       3     c
4       4     a
5       5     a
6       6     b

In [110]:
joinDf_7 = pd.DataFrame({
    'data_7': range(3),
},
    index=['a', 'b', 'd'],
)
joinDf_7

   data_7
a       0
b       1
d       2

In [111]:
pd.merge(joinDf_6, joinDf_7, left_on='key_6', right_index=True, how='outer')

   data_6 key_6  data_7
0     0.0     b     1.0
1     1.0     b     1.0
6     6.0     b     1.0
2     2.0     a     0.0
4     4.0     a     0.0
5     5.0     a     0.0
3     3.0     c     NaN
6     NaN     d     2.0

In [112]:
joinDf_8 = pd.DataFrame({
    'key_8_0': ['a', 'a', 'b'],
    'key_8_1': [1, 2, 1],
    'val_8': ['A', 'B', 'C']
})
joinDf_8

  key_8_0  key_8_1 val_8
0       a        1     A
1       a        2     B
2       b        1     C

In [113]:
joinDf_9 = pd.DataFrame(
    data={
        'val_9': ['D', 'E', 'F', 'G']
    },
    index=[
        ['a', 'a', 'b', 'b'],
        [1, 1, 1, 2]
    ]
)
joinDf_9

    val_9
a 1     D
  1     E
b 1     F
  2     G

In [114]:
pd.merge(joinDf_8, joinDf_9, left_on=['key_8_0', 'key_8_1'], right_index=True, how="outer")

  key_8_0  key_8_1 val_8 val_9
0       a        1     A     D
0       a        1     A     E
1       a        2     B   NaN
2       b        1     C     F
2       b        2   NaN     G

In [115]:
joinDf_10 = pd.DataFrame(
    data={
        'val_10': ['A', 'B', 'C']
    },
    index=[
        ['a', 'a', 'b'],
        [1, 2, 1]
    ]
)
joinDf_10

    val_10
a 1      A
  2      B
b 1      C

In [116]:
joinDf_11 = pd.DataFrame(
    data={
        'val_11': ['D', 'E', 'F', 'G']
    },
    index=[
        ['a', 'a', 'b', 'b'],
        [1, 1, 1, 2]
    ]
)
joinDf_11

    val_11
a 1      D
  1      E
b 1      F
  2      G

In [117]:
pd.merge(joinDf_10, joinDf_11, left_index=True, right_index=True, how="outer")

    val_10 val_11
a 1      A      D
  1      A      E
  2      B    NaN
b 1      C      F
  2    NaN      G

# concate

In [118]:
concateDf_0 = pd.DataFrame(
    data=np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
    columns=['one', 'two']
)
concateDf_0

   one  two
a    0    1
b    2    3
c    4    5

In [119]:
concateDf_1 = pd.DataFrame(
    data=5 + np.arange(4).reshape(2, 2), 
    index=['a', 'c'],
    columns=['three', 'four']
)
concateDf_1

   three  four
a      5     6
c      7     8

In [120]:
pd.concat([concateDf_0, concateDf_1], axis=1, keys=['df_0', 'df_1'])

  df_0      df_1
   one two three four
a    0   1   5.0  6.0
b    2   3   NaN  NaN
c    4   5   7.0  8.0

In [121]:
concateDf_2 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
concateDf_2

          a         b         c         d
0  1.572557  0.635363 -1.168601 -0.937739
1  1.519934  0.205504 -0.249476 -1.725663
2 -0.601625  1.035805  0.553088  1.211290

In [122]:
concateDf_3 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
concateDf_3

          b         d         a
0  1.469459 -0.057109  0.412549
1  1.103823 -0.919223 -0.595211

In [123]:
pd.concat([concateDf_2, concateDf_3], ignore_index=True)

          a         b         c         d
0  1.572557  0.635363 -1.168601 -0.937739
1  1.519934  0.205504 -0.249476 -1.725663
2 -0.601625  1.035805  0.553088  1.211290
3  0.412549  1.469459       NaN -0.057109
4 -0.595211  1.103823       NaN -0.919223

# combine first

In [124]:
combine_first_0 = pd.DataFrame({
    'a': [1, np.nan, 2, np.nan],
    'b': ['a', None, 'c', None]
})
combine_first_0

     a     b
0  1.0     a
1  NaN  None
2  2.0     c
3  NaN  None

In [125]:
combine_first_1 = pd.DataFrame({
    'a': [100, 200, 300, 400],
    'b': ['AAA', 'BBB', 'CCC', 'DDD']
})
combine_first_1

     a    b
0  100  AAA
1  200  BBB
2  300  CCC
3  400  DDD

In [126]:
combine_first_0.combine_first(combine_first_1)

       a    b
0    1.0    a
1  200.0  BBB
2    2.0    c
3  400.0  DDD

# stack / unstack

In [127]:
stack_0 = pd.DataFrame({
    'a': [100, 200, 300, 400],
    'b': ['AAA', 'BBB', 'CCC', 'DDD']
})
stack_0

     a    b
0  100  AAA
1  200  BBB
2  300  CCC
3  400  DDD

In [128]:
stack_1 = stack_0.stack()
stack_1

0  a    100
   b    AAA
1  a    200
   b    BBB
2  a    300
   b    CCC
3  a    400
   b    DDD
dtype: object

In [129]:
stack_1.unstack()

     a    b
0  100  AAA
1  200  BBB
2  300  CCC
3  400  DDD

In [130]:
stack_1.unstack(0)

     0    1    2    3
a  100  200  300  400
b  AAA  BBB  CCC  DDD

In [131]:
stack_2 = pd.DataFrame(
    data=np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
    columns=['one', 'two']
)
stack_3 = pd.DataFrame(
    data=5 + np.arange(4).reshape(2, 2), 
    index=['a', 'c'],
    columns=['three', 'four']
)
stack_4 = pd.concat([stack_2, stack_3], axis=1, keys=['df_0', 'df_1'])
stack_4.index.names = ['name_0']
stack_4.columns.names = ['name_1', 'name_2']
stack_4

name_1 df_0      df_1
name_2  one two three four
name_0
a         0   1   5.0  6.0
b         2   3   NaN  NaN
c         4   5   7.0  8.0

In [132]:
stack_4.stack("name_1")

name_2         four  one  three  two
name_0 name_1
a      df_0     NaN  0.0    NaN  1.0
       df_1     6.0  NaN    5.0  NaN
b      df_0     NaN  2.0    NaN  3.0
c      df_0     NaN  4.0    NaN  5.0
       df_1     8.0  NaN    7.0  NaN

# long to wide format

In [133]:
longToWideFormat = pd.read_csv('/home/hsiehpinghan/git/python/pandas-python/data/csv/tsvFileOfTimeSeries.tsv', sep='\t')
longToWideFormat

    year  quarter  integerTypeField  longTypeField  shortTypeField
0   2000        1                 1             10             100
1   2000        2                 2             20             200
2   2000        3                 3             30             300
3   2000        4                 4             40             400
4   2001        1                 5             50             500
5   2001        2                 6             60             600
6   2001        3                 7             70             700
7   2001        4                 8             80             800
8   2002        1                 9             90             900
9   2002        2                10            100            1000
10  2002        3                11            110            1100
11  2002        4                12            120            1200

In [134]:
periods = pd.PeriodIndex(
    year=longToWideFormat.year, 
    quarter=longToWideFormat.quarter,
    name='date'
)
periods

PeriodIndex(['2000Q1', '2000Q2', '2000Q3', '2000Q4', '2001Q1', '2001Q2',
             '2001Q3', '2001Q4', '2002Q1', '2002Q2', '2002Q3', '2002Q4'],
            dtype='period[Q-DEC]', name='date', freq='Q-DEC')

In [135]:
columns = pd.Index(['integerTypeField', 'longTypeField', 'shortTypeField'], name='item')
columns

Index(['integerTypeField', 'longTypeField', 'shortTypeField'], dtype='object', name='item')

In [136]:
longToWideFormat = longToWideFormat.reindex(columns=columns)
longToWideFormat

item  integerTypeField  longTypeField  shortTypeField
0                    1             10             100
1                    2             20             200
2                    3             30             300
3                    4             40             400
4                    5             50             500
5                    6             60             600
6                    7             70             700
7                    8             80             800
8                    9             90             900
9                   10            100            1000
10                  11            110            1100
11                  12            120            1200

In [137]:
longToWideFormat.index = periods.to_timestamp(freq='D', how='end')
longToWideFormat

item        integerTypeField  longTypeField  shortTypeField
date
2000-03-31                 1             10             100
2000-06-30                 2             20             200
2000-09-30                 3             30             300
2000-12-31                 4             40             400
2001-03-31                 5             50             500
2001-06-30                 6             60             600
2001-09-30                 7             70             700
2001-12-31                 8             80             800
2002-03-31                 9             90             900
2002-06-30                10            100            1000
2002-09-30                11            110            1100
2002-12-31                12            120            1200

In [138]:
longFormat = longToWideFormat.stack().reset_index().rename(columns={0: 'value'})
longFormat

         date              item  value
0  2000-03-31  integerTypeField      1
1  2000-03-31     longTypeField     10
2  2000-03-31    shortTypeField    100
3  2000-06-30  integerTypeField      2
4  2000-06-30     longTypeField     20
5  2000-06-30    shortTypeField    200
6  2000-09-30  integerTypeField      3
7  2000-09-30     longTypeField     30
8  2000-09-30    shortTypeField    300
9  2000-12-31  integerTypeField      4
10 2000-12-31     longTypeField     40
11 2000-12-31    shortTypeField    400
12 2001-03-31  integerTypeField      5
13 2001-03-31     longTypeField     50
14 2001-03-31    shortTypeField    500
15 2001-06-30  integerTypeField      6
16 2001-06-30     longTypeField     60
17 2001-06-30    shortTypeField    600
18 2001-09-30  integerTypeField      7
19 2001-09-30     longTypeField     70
20 2001-09-30    shortTypeField    700
21 2001-12-31  integerTypeField      8
22 2001-12-31     longTypeField     80
23 2001-12-31    shortTypeField    800
24 2002-03-31  integerTypeField      9
25 2002-03-31     longTypeField     90
26 2002-03-31    shortTypeField    900
27 2002-06-30  integerTypeField     10
28 2002-06-30     longTypeField    100
29 2002-06-30    shortTypeField   1000
30 2002-09-30  integerTypeField     11
31 2002-09-30     longTypeField    110
32 2002-09-30    shortTypeField   1100
33 2002-12-31  integerTypeField     12
34 2002-12-31     longTypeField    120
35 2002-12-31    shortTypeField   1200

In [139]:
wideFormat = longFormat.pivot(index='date', columns='item', values='value')
wideFormat

item        integerTypeField  longTypeField  shortTypeField
date
2000-03-31                 1             10             100
2000-06-30                 2             20             200
2000-09-30                 3             30             300
2000-12-31                 4             40             400
2001-03-31                 5             50             500
2001-06-30                 6             60             600
2001-09-30                 7             70             700
2001-12-31                 8             80             800
2002-03-31                 9             90             900
2002-06-30                10            100            1000
2002-09-30                11            110            1100
2002-12-31                12            120            1200

In [140]:
longFormat['value_1'] = np.random.randn(len(longFormat))
longFormat

         date              item  value   value_1
0  2000-03-31  integerTypeField      1  1.797075
1  2000-03-31     longTypeField     10  0.501291
2  2000-03-31    shortTypeField    100  0.678580
3  2000-06-30  integerTypeField      2  2.337297
4  2000-06-30     longTypeField     20  0.102259
5  2000-06-30    shortTypeField    200  2.248158
6  2000-09-30  integerTypeField      3  0.118884
7  2000-09-30     longTypeField     30  1.180509
8  2000-09-30    shortTypeField    300 -0.686399
9  2000-12-31  integerTypeField      4 -0.047662
10 2000-12-31     longTypeField     40  0.367292
11 2000-12-31    shortTypeField    400 -0.732002
12 2001-03-31  integerTypeField      5  0.607221
13 2001-03-31     longTypeField     50  0.617493
14 2001-03-31    shortTypeField    500  1.003936
15 2001-06-30  integerTypeField      6 -2.147829
16 2001-06-30     longTypeField     60 -0.541406
17 2001-06-30    shortTypeField    600  2.333229
18 2001-09-30  integerTypeField      7 -0.652021
19 2001-09-30     longTypeField     70  1.460768
20 2001-09-30    shortTypeField    700  0.308720
21 2001-12-31  integerTypeField      8  1.370662
22 2001-12-31     longTypeField     80  0.342107
23 2001-12-31    shortTypeField    800  0.656415
24 2002-03-31  integerTypeField      9  3.085269
25 2002-03-31     longTypeField     90 -0.595863
26 2002-03-31    shortTypeField    900  0.991960
27 2002-06-30  integerTypeField     10  0.301525
28 2002-06-30     longTypeField    100 -0.449223
29 2002-06-30    shortTypeField   1000 -1.897065
30 2002-09-30  integerTypeField     11  0.220616
31 2002-09-30     longTypeField    110 -0.364535
32 2002-09-30    shortTypeField   1100 -0.194822
33 2002-12-31  integerTypeField     12 -1.063139
34 2002-12-31     longTypeField    120 -0.366943
35 2002-12-31    shortTypeField   1200  1.440234

In [141]:
wideFormat = longFormat.pivot(index='date', columns='item')
wideFormat

                      value                                       value_1  \
item       integerTypeField longTypeField shortTypeField integerTypeField
date
2000-03-31                1            10            100         1.797075
2000-06-30                2            20            200         2.337297
2000-09-30                3            30            300         0.118884
2000-12-31                4            40            400        -0.047662
2001-03-31                5            50            500         0.607221
2001-06-30                6            60            600        -2.147829
2001-09-30                7            70            700        -0.652021
2001-12-31                8            80            800         1.370662
2002-03-31                9            90            900         3.085269
2002-06-30               10           100           1000         0.301525
2002-09-30               11           110           1100         0.220616
2002-12-31               12           120           1200        -1.063139


item       longTypeField shortTypeField
date
2000-03-31      0.501291       0.678580
2000-06-30      0.102259       2.248158
2000-09-30      1.180509      -0.686399
2000-12-31      0.367292      -0.732002
2001-03-31      0.617493       1.003936
2001-06-30     -0.541406       2.333229
2001-09-30      1.460768       0.308720
2001-12-31      0.342107       0.656415
2002-03-31     -0.595863       0.991960
2002-06-30     -0.449223      -1.897065
2002-09-30     -0.364535      -0.194822
2002-12-31     -0.366943       1.440234

# wide to long format

In [142]:
wideToLongFormat = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9],
    'D': ['one', 'two', 'three'],
})
wideToLongFormat

   A  B  C      D
0  1  4  7    one
1  2  5  8    two
2  3  6  9  three

In [143]:
longFormat = pd.melt(wideToLongFormat, id_vars=['D'])
longFormat

       D variable  value
0    one        A      1
1    two        A      2
2  three        A      3
3    one        B      4
4    two        B      5
5  three        B      6
6    one        C      7
7    two        C      8
8  three        C      9

In [144]:
wideFormat = longFormat.pivot('D', 'variable', 'value')
wideFormat

variable  A  B  C
D
one       1  4  7
three     3  6  9
two       2  5  8

In [145]:
wideFormat.reset_index()

variable      D  A  B  C
0           one  1  4  7
1         three  3  6  9
2           two  2  5  8

# group by

In [3]:
df = pd.DataFrame({
    'col_0' : ['a', 'a', 'b', 'b', 'a'],
    'col_1' : ['one', 'two', 'one', 'two', 'one'],
    'col_2' : np.random.randn(5),
    'col_3' : np.random.randn(5)
})
df

  col_0 col_1     col_2     col_3
0     a   one  1.287512 -1.189963
1     a   two  0.375759 -1.327921
2     b   one -0.987188  1.130225
3     b   two  1.497956 -2.060483
4     a   one  0.281605 -1.139955

In [5]:
mean = df['col_2'].groupby(df['col_0']).mean()
mean

col_0
a    0.648292
b    0.255384
Name: col_2, dtype: float64

In [7]:
mean = df['col_2'].groupby([df['col_0'], df['col_1']]).mean()
mean

col_0  col_1
a      one      0.784559
       two      0.375759
b      one     -0.987188
       two      1.497956
Name: col_2, dtype: float64

In [8]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['col_2'].groupby([states, years]).mean()

California  2005    0.375759
            2006   -0.987188
Ohio        2005    1.392734
            2006    0.281605
Name: col_2, dtype: float64

In [10]:
for key, group in df.groupby(df['col_0']):
    print(key)
    print(group)

a
  col_0 col_1     col_2     col_3
0     a   one  1.287512 -1.189963
1     a   two  0.375759 -1.327921
4     a   one  0.281605 -1.139955
b
  col_0 col_1     col_2     col_3
2     b   one -0.987188  1.130225
3     b   two  1.497956 -2.060483

In [11]:
for (key_0, key_1), group in df.groupby(['col_0', 'col_1']):
    print((key_0, key_1))
    print(group)

('a', 'one')
  col_0 col_1     col_2     col_3
0     a   one  1.287512 -1.189963
4     a   one  0.281605 -1.139955
('a', 'two')
  col_0 col_1     col_2     col_3
1     a   two  0.375759 -1.327921
('b', 'one')
  col_0 col_1     col_2     col_3
2     b   one -0.987188  1.130225
('b', 'two')
  col_0 col_1     col_2     col_3
3     b   two  1.497956 -2.060483

# group by with dict

In [29]:
df = pd.DataFrame(
    np.random.randn(5, 5),
    columns=['a', 'b', 'c', 'd', 'e'],
    index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis']
)
df

               a         b         c         d         e
Joe    -0.810974 -0.385218  0.624785  0.638831  0.138859
Steve  -0.125443  0.564803 -2.005181 -0.186508  1.198644
Wes    -0.658245  1.074446 -0.162311  1.808803  0.473654
Jim    -1.129457  0.562322 -1.001466 -1.172758  0.576596
Travis  0.886983 -0.961721 -0.132492 -0.516933  0.578551

In [34]:
mapping = {
    'a': 'red', 
    'b': 'red', 
    'c': 'blue',
    'd': 'blue', 
    'e': 'red', 
    'f' : 'not_exist'
}
mapping

{'a': 'red',
 'b': 'red',
 'c': 'blue',
 'd': 'blue',
 'e': 'red',
 'f': 'not_exist'}

In [35]:
df.groupby(mapping, axis=1).sum()

            blue       red
Joe     1.263616 -1.057332
Steve  -2.191689  1.638004
Wes     1.646492  0.889856
Jim    -2.174224  0.009461
Travis -0.649425  0.503813

# group by with function

In [37]:
df = pd.DataFrame(
    np.random.randn(5, 5),
    columns=['a', 'b', 'c', 'd', 'e'],
    index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis']
)
df

               a         b         c         d         e
Joe    -1.244891  1.461584 -0.852154  0.566959 -0.325725
Steve   0.417576 -1.896877  0.487687  0.826403 -0.500610
Wes     0.832785  0.136771 -0.394016 -1.656627 -1.475117
Jim    -1.017019 -0.086102  1.077800 -0.552099  0.170579
Travis -0.305388  1.075601  1.172278 -0.217204  0.762256

In [38]:
df.groupby(len).sum()

          a         b         c         d         e
3 -1.429125  1.512253 -0.168369 -1.641767 -1.630263
5  0.417576 -1.896877  0.487687  0.826403 -0.500610
6 -0.305388  1.075601  1.172278 -0.217204  0.762256

# group by index level

In [39]:
columnIndexes = pd.MultiIndex.from_arrays(
    [
        ['US', 'US', 'US', 'JP', 'JP'],
        [1, 3, 5, 1, 3]
    ],
    names=['cty', 'tenor']
)
df = pd.DataFrame(np.random.randn(4, 5), columns=columnIndexes)
df

cty          US                            JP
tenor         1         3         5         1         3
0      0.950047  0.058147 -0.195362  1.477254  0.165743
1      1.126786 -1.864584  0.363316 -0.152549 -0.060987
2      1.257455 -0.457969 -0.576828  0.934611 -0.319357
3      0.645100 -1.937777 -1.057114  1.321067  0.518339

In [40]:
df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3